ТорговоеПредприятие/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТорговоеПредприятие/src/Documents/Продажа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Акт(ТабДок, Ссылка) Экспорт

	Макет = ПолучитьМакет("Акт");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	Продажа.Номер,
		|	Продажа.Дата,
		|	Продажа.Контрагент,
		|	Продажа.Организация,
		|	Продажа.Договор,
		|	Продажа.Склад,
		|	Продажа.Ответственный,
		|	Продажа.СписокНоменклатуры.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Цена,
		|		Количество,
		|		Сумма)
		|ИЗ
		|	Документ.Продажа КАК Продажа
		|ГДЕ
		|	Продажа.Ссылка В (&Ссылка)";
		
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыЗаголовка = Новый Структура;
		ПараметрыЗаголовка.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ПараметрыЗаголовка.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD;"));
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
		ВыборкаСписокНоменклатуры = Выборка.СписокНоменклатуры.Выбрать();
		СуммаИтого = 0;
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			ОбластьСписокНоменклатуры.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
			ТабДок.Вывести(ОбластьСписокНоменклатуры, ВыборкаСписокНоменклатуры.Уровень());
			СуммаИтого = СуммаИтого + ВыборкаСписокНоменклатуры.Сумма;
		КонецЦикла;
		
		ПарПредмета ="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	
		ПараметрыПодвала = Новый Структура;
		ПараметрыПодвала.Вставить("СуммаИтогоПрописью", ЧислоПрописью(СуммаИтого,, ПарПредмета));
		
		Подвал.Параметры.Заполнить(ПараметрыПодвала);
		Подвал.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(Подвал);	
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УдалитьЛидирующиеНули(Строка)
	
	Результат = Строка;
	Пока СтрНачинаетсяС(Результат, "0") Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
